fastjson-api-serialized-json/app/controllers/application_controller.rb

  def fetch_current_user
    @current_user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]