jbuilder-for-json-data/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def fetch_current_user
    @current_user = User.find_by(id: params[:user_id])